title: Execution from /tmp or World-Writable
id: proc-lnx-tmp-exec
status: experimental
description: Process executed from /tmp or /dev/shm
author: EDR-Linux
date: 2026/02/15
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    Image|startswith: '/tmp/'
  selection_shm:
    Image|startswith: '/dev/shm/'
  condition: 1 of selection*
level: high
tags:
  - attack.execution
