title: SSH Authorized Key Injection
id: proc-lnx-ssh-key-inject
status: experimental
description: Detects writing to SSH authorized_keys files for backdoor persistence
author: EDR-Linux
date: 2026/03/09
logsource:
  category: process_creation
  product: linux
detection:
  selection_echo_ssh:
    Image|endswith: '/echo'
    CommandLine|contains: 'authorized_keys'
  selection_tee_ssh:
    Image|endswith: '/tee'
    CommandLine|contains: 'authorized_keys'
  selection_cp_ssh:
    Image|endswith: '/cp'
    CommandLine|contains: 'authorized_keys'
  selection_curl_ssh:
    CommandLine|contains: 'authorized_keys'
  condition: 1 of selection*
level: high
tags:
  - attack.persistence
  - attack.t1098
