title: Awk Reverse Shell
id: proc-lnx-awk-revshell
status: experimental
description: Detects awk/gawk reverse shell using /inet/ network redirect
author: EDR-Linux
date: 2026/03/08

logsource:
  category: process_creation
  product: linux

detection:
  # awk 'BEGIN{s="/inet/tcp/0/attacker/port";...}'
  selection:
    Image|endswith:
      - '/awk'
      - '/gawk'
    CommandLine|contains: '/inet/'

  condition: selection

level: high

tags:
  - attack.execution
  - attack.t1059.004
