title: LD_PRELOAD or LD_LIBRARY_PATH Abuse
id: proc-lnx-ld-preload
status: experimental
description: Execution with LD_PRELOAD or suspicious LD_LIBRARY_PATH
author: EDR-Linux
date: 2026/02/15
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    CommandLine|contains: 'LD_PRELOAD'
  selection_ld:
    CommandLine|contains: 'LD_LIBRARY_PATH=/tmp'
  condition: 1 of selection*
level: high
tags:
  - defense_evasion
