title: Python Reverse Shell
id: proc-lnx-python-revshell
status: experimental
description: Detects Python one-liner reverse shells using socket and subprocess
author: EDR-Linux
date: 2026/03/08

logsource:
  category: process_creation
  product: linux

detection:
  # python -c 'import socket,...'
  # python3 -c 'import socket,...'
  selection_socket:
    Image|endswith:
      - 'python'
      - 'python3'
      - 'python2'
    CommandLine|contains: 'import socket'

  selection_pty:
    Image|endswith:
      - 'python'
      - 'python3'
      - 'python2'
    CommandLine|contains: 'import pty'

  selection_popen:
    Image|endswith:
      - 'python'
      - 'python3'
      - 'python2'
    CommandLine|contains: 'popen'

  condition: 1 of selection*

level: high

tags:
  - attack.execution
  - attack.t1059.006
